[
{"app_id": "c6e926167284b9777deed98255b18761", "author": "LDNIO", "rating": "5", "posted_at": "April 19, 2022", "body": "Great app, I used it to hide Add to cart button, and the tech support stuff helped me to remove the extra blank space, thanks a lot.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "Walk Around Kitty", "rating": "5", "posted_at": "November 16, 2021", "body": "This app is essential for every store. It works efficiently and I believe it has increased my store's conversion rate.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "Lille Søn", "rating": "5", "posted_at": "August 23, 2021", "body": "Works well. First it didn´t work in my theme, but a quick support from the dev fixed this problem. Recommend it.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "The Coffee Shopping Network", "rating": "5", "posted_at": "July 18, 2021", "body": "seems to work well and helps with conversions. It would be good the see if their is a way in the future to gather stats.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "HN Bazar", "rating": "5", "posted_at": "May 27, 2021", "body": "The support team help to upgrade my store to the next level.\nI have 2 apps from this company and both of working perfect and support add for a customization very fast.\nVery professional support.\nThanks", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "Winade-Shop - Leckere Bioerfrischungen", "rating": "5", "posted_at": "April 30, 2021", "body": "I used it to make the product fee app run. Without it the app did not work. The support was good and fast.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "tlant", "rating": "4", "posted_at": "April 30, 2021", "body": "The app does what it says.\nAnd support is fast and professional. I have requested to make a minor adjustment and they did this right away.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "Crank Baiter", "rating": "5", "posted_at": "March 29, 2021", "body": "Works fine for desktop but on mobile, the page refreshes as soon as I click on the quantity which does not allow me enough time to enter the desired quantity. UPDATE: The team contacted me promptly and it had to do something with the theme that I was using and not the App itself and their willingness to help is greatly appreciated.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "SUPERGSUND.DE", "rating": "5", "posted_at": "March 18, 2021", "body": "Very little, but very helpful App for every Shopify-Store. Makes it much more easier for all customers handling already added products in his shopping cart as you must not always click and click and click funny buttons. Works perfect on Desktop, mobil and Tablet. Support is very fast and friendly. Top!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "c6e926167284b9777deed98255b18761", "author": "Scuba Beer", "rating": "5", "posted_at": "March 10, 2021", "body": "App works great and as described. The support team reply and attend to slight tweaks in the software straight away. Would recommend.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "OTAA", "rating": "5", "posted_at": "April 20, 2022", "body": "Amazing application,\ngreat service and really save time printing 500 orders at a time.\nIf you guys can roll out\n- Sort by Product SKU before generating packing slips / invoices (right now its only product name, you can sort by SKU in the picking list)\n- Being able to highlight certain keywords within certain fields to help staff pick up certain keywords. (The CSS edits aren't able to do this) Would make this great app even greater.\nThanks guys!", "helpful_count": "0", "developer_reply": "Thank you for sharing your 5-star experience with us 😊 We're glad you are enjoying our app. \nYour feedback is super helpful for our development team. We will take it into account. \nHave a great day. \nKind Regards,\nSarah / FORSBERG+two", "developer_reply_date": "April 20, 2022"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Three Tarts", "rating": "5", "posted_at": "February 7, 2022", "body": "We use this app to organize the orders at our bakeshop. The picking list allows us to quickly total the number of each product that we need for the day. And the print out allows us to sort by order number or time of pickup, which we use when packaging up our orders and as a reference when customers are picking up their orders. Very helpful and a big time saver. Recently, I reached out for support and they went above & beyond to make sure a feature was working properly for us. Thank-you for your friendly support. We really appreciate it!", "helpful_count": "0", "developer_reply": "...and we really appreciate customers like you! Thank you for the kind review. We take pride in friendly and helpful customer service, so we appreciate that you noticed :)\nKind Regards,\nSarah / FORSBERG+two", "developer_reply_date": "February 9, 2022"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Millie & Dot", "rating": "5", "posted_at": "January 31, 2022", "body": "This app has streamlined our order prepping process. Customer service responded to a modification we needed quickly and competently!", "helpful_count": "0", "developer_reply": "Thank you so much for the five stars and for sharing your feedback. Excellent to hear it has helped you streamline your order prepping process! \nKind Regards,\nSarah / FORSBERG+two", "developer_reply_date": "February 1, 2022"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Scented Narcissi", "rating": "5", "posted_at": "January 25, 2022", "body": "I honestly can't rate this app highly enough! It has helped solve so many of our order processing problems from pick lists to printing gift messages and we couldn't function without it! Whenever I have had a query it has been dealt with instantly and there is always someone to help. Thank you so much!", "helpful_count": "0", "developer_reply": "Wow, we're blown away by your positive words and appreciate the time you took to write such an excellent review!\nKind Regards,\nSarah / FORSBERG+two", "developer_reply_date": "January 26, 2022"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "helloclayre", "rating": "5", "posted_at": "January 16, 2022", "body": "Best customer support! Replied in a few minutes with the right solution! Highly recommend the apps from Forsberg :)", "helpful_count": "0", "developer_reply": "That's music to our ears! Thank you for taking the time to leave a review :) \nKind Regards,\nSarah / FORSBERG+two", "developer_reply_date": "January 17, 2022"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Hewitt's Meats", "rating": "5", "posted_at": "December 22, 2021", "body": "I have used Orderly Print through 2 of my peak seasons now. It is the best packing slip app I could find and they have been great to work with. My team was not noticing when there were multiples of a single item when it was really busy, so we were short picking customer orders. I reached out on a Sunday in December to see if they could make a tweak to help me make the quantity larger when there was more than a quantity of one. I now have it pop up in red and 300 times larger! That problem went away completely. The ease of use of the app was always great, but I was so impressed with the support I got during the peak times of the year. I also like how they have worked together the app Order Tagger to make both of their applications better. Thank you Orderly Print!! Brian Hanson\nHewittsMeats.com", "helpful_count": "0", "developer_reply": "Thanks Brian! Reviews like yours make our day because it makes all the hard work worthwhile. It's so fantastic that OrderlyPrint has made a difference for you and your team. \nKind regards, \nSarah / FORSBERG+two", "developer_reply_date": "December 23, 2021"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Chinga Clothing", "rating": "5", "posted_at": "December 1, 2021", "body": "Great app! The customer service team was extremely quick to reply and assist with our queries. Highly recommend !", "helpful_count": "0", "developer_reply": "We appreciate the fantastic review and are glad we could be of service. If you have any further needs or questions, please reach out!\nKind regards, \nSarah / FORSBERG+two", "developer_reply_date": "December 2, 2021"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Mask Co", "rating": "5", "posted_at": "April 3, 2022", "body": "Perfect!! Excellent app for detailed invoices particularly if you have many variants etc like colors and sizes. Easy to edit or add/remove information. Support is the best I have ever experienced with thorough, detailed responses and instructions. Excellent.", "helpful_count": "0", "developer_reply": "Great to hear our support team was able to help you out, and so good to hear you think our app is the best ;) Thanks for taking the time to leave a review. \nKind regards, \nSarah / FORSBERG+two", "developer_reply_date": "August 26, 2021"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Alto Collective", "rating": "5", "posted_at": "April 16, 2021", "body": "We use this app daily to delegate work tasks, sort and print slimmed down order \"Picking Lists\" which ends up being our build sheets, and then are able to print basic address labels for select orders not requiring our thermal printer+tracked shipping. Developers are quick to help out with any issues you may have, overall we have had only 2 random issues occur in the last 5 years, and these seemed to be syncing issues caused on the Shopify side. The team had workarounds in under 24 hrs for both those instances so we could get back up and running with virtually no downtime. Highly recommended.", "helpful_count": "0", "developer_reply": "What a pleasure to hear! Thanks for taking the time to leave a review :)\nKind regards,\nSarah / FORSBERG+two", "developer_reply_date": "August 23, 2021"},
{"app_id": "1745b364dd9ae369d8ed6d4221163761", "author": "Dunns Bakery Local Delivery", "rating": "5", "posted_at": "March 15, 2021", "body": "Great app, helpful and fast responses on queries. V happy. Invoices and pick lists look great so yeah happy days.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "Cloudyfuser UK", "rating": "1", "posted_at": "October 17, 2021", "body": "Yes I agree this app is unfortunately useless.... so waste of time... Hmmmm Does not do anything at all", "helpful_count": "1", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "Icon Brands", "rating": "1", "posted_at": "June 17, 2021", "body": "APP does not work at all, no response from PayPal! I see it on other sites working fine but cannot get any help! Here is what you get! {\"success\":false,\"message\":\"There was a problem processing your request. Please uninstall and install the app again.\",\"sys\":{\"locality\":{\"timezone\":{\"determiner\":\"viaCowPrimary\",\"value\":\"America/Los_Angeles\"},\"country\":\"US\",\"locale\":\"en_US\",\"language\":\"en\",\"directionality\":\"ltr\"},\"links\":{\"jsBaseUrl\":\"https://www.paypalobjects.com/web/res/4e6/3d0eddb4dfb88fd88e7c3e9d8e5c6/js\",\"cssBaseUrl\":\"https://www.paypalobjects.com/web/res/4e6/3d0eddb4dfb88fd88e7c3e9d8e5c6/css\",\"templateBaseUrl\":\"https://www.paypalobjects.com/web/res/4e6/3d0eddb4dfb88fd88e7c3e9d8e5c6/templates\",\"resourceBaseUrl\":\"https://www.paypalobjects.com/web/res/4e6/3d0eddb4dfb88fd88e7c3e9d8e5c6\"},\"pageInfo\":{\"date\":\"Jun 17, 2021 04:37:20 -07:00\",\"hostName\":\"rZJvnqaaQhLn/nmWT8cSUjOx898qoYZ0q9jnz54WwRw9jMjo7ftbKBWvBlCV+2Bw\",\"rlogId\":\"rZJvnqaaQhLn%2FnmWT8cSUpRjJD5nY97qwkbIOwpFwBPMox59W7vl6%2Frk%2BGgWq59l5sKhkFbLHx0v9KXWQEzzGg_17a19c2e1c2\",\"script\":\"node\",\"debug\":null},\"tracking\":{\"fpti\":{\"name\":\"pta\",\"jsURL\":\"https://www.paypalobjects.com\",\"serverURL\":\"https://t.paypal.com/ts\",\"dataString\":\"pgrp=musepluginnodeweb%2Fpublic%2Ftemplates%2F.dust&page=musepluginnodeweb%2Fpublic%2Ftemplates%2F.dust&pgst=1623929840066&calc=367b2cfc1749c&nsid=xgFxYnHEmJOgNbz9eZR_rEptbWJROF78&rsta=en_US&pgtf=Nodejs&env=live&s=ci&ccpg=US&csci=5dac9a886e374682bb504d1a48b98b1e&comp=musepluginnodeweb&tsrce=musepluginnodeweb&cu=1&gacook=1767339872.1610394005&ef_policy=ccpa&c_prefs=P%3D1%2CF%3D1%2Ctype%3Dimplicit\"}}}}", "helpful_count": "2", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "Jack Stillman", "rating": "1", "posted_at": "September 20, 2020", "body": "So mad at PayPal and this app. I used the features but decided they were not adding any value so I uninstalled. I now have code embedded (god knows where), in my site. I contacted PayPal to ask for assistance to turn off the incessant pop-ups and they told me they had never heard of this app. After submitting screenshots my request was closed and they advised me to pay for a developer to try and remove it. F** you PayPal!", "helpful_count": "9", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "THE FOSSIL STORE", "rating": "1", "posted_at": "July 12, 2020", "body": "We have just installed this app and waited an hour after activation to see if it might be slow on updating and nothing happens, it simply doesn't work.", "helpful_count": "3", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "BostonsBestJeweler", "rating": "1", "posted_at": "October 27, 2019", "body": "Every single person who works at paypal is incompetent. That goes for everyone who developed this app also.", "helpful_count": "28", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "FreshForPandas", "rating": "1", "posted_at": "October 13, 2019", "body": "Ap didn’t work - error messages upon install. Even the download link for the app att the PayPal site just goes to an error page. Support did not respond", "helpful_count": "7", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "USAWIDGETTS", "rating": "1", "posted_at": "March 16, 2019", "body": "It stared find , but after using it for few days it when away , I try to re-installed a few times with no luck , it will be nice to get it back to work on my site .\nwww.usawidgetts.com", "helpful_count": "6", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "The Happy tourists", "rating": "1", "posted_at": "January 29, 2019", "body": "If you want to lose sales please install this app. What a crap because of this I lost almost 20 orders it doesn't login the user and thus they leave. :(", "helpful_count": "3", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "Independent Reign", "rating": "1", "posted_at": "January 28, 2019", "body": "This app changed a setting in my PayPal account that effectively blocked incoming international payments.  International customers were unable to complete purchases using PayPal.  I had no idea and could not figure out what the issue was and lost sales because of it.  Finally had a customer patient enough to describe her experience in attempting to check out... I provided the info to PayPal and was told about the changed setting which coincided with the day I downloaded this App.  Beware of this.  Not happy.", "helpful_count": "5", "developer_reply": null, "developer_reply_date": null},
{"app_id": "dcffecbffa76560e6e077923abe0b394", "author": "Club Vest Biker Motorcycle Apparel & Accessories", "rating": "5", "posted_at": "January 19, 2019", "body": "Been with PayPal for 15 years or more, this is an easy app, works great simple setup and customer can close it too, used to have a manual banner on our old site, did increase sales to qualified buyers. some love paypal some hate, but they WILL increase sales", "helpful_count": "1", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "Warrior Eco Power Equipment", "rating": "4", "posted_at": "February 1, 2022", "body": "I needed to copy orders and customers across to a new site. The only reason I didn't give 5 stars was that I could not do so without copying across products (the products were already in the new site so I had to delete these and copy again). The orders that were copied across triggered email notifications which was also not expected - so it would be nice if the documentation had let us know that before hand.", "helpful_count": "0", "developer_reply": "Hi, this is Guille from the Duplicate app. Thanks for your review and for sharing your experience with our app. It's correct that for exporting orders, we need to map first the product ids between the two stores. That's why products need to be exported first. If not, orders will be empty. Regarding the orders email notifications, just clarify that customers don't get any emails when new orders are exported through our app. It's just the store owner who gets them if in the destination store has the \"New order\" notification option activated in the \"Staff order notifications\" section at /admin/settings/notifications.", "developer_reply_date": "February 1, 2022"},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "MoringaProducts", "rating": "5", "posted_at": "January 19, 2022", "body": "Fantastic app and even better customer support. I have used this app twice now and on the second it did not all go to plan, however the customer support was right there and fixed the issues straight away. Highly reccomend!", "helpful_count": "0", "developer_reply": "Thank you for the kind words! We're very proud of our support team, glad to hear you had a positive experience.", "developer_reply_date": "March 22, 2022"},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "Perun moto", "rating": "5", "posted_at": "January 2, 2022", "body": "Easy and straightforward process. All our product images, including alt text, we successfully copied, all pages, collections etc.", "helpful_count": "0", "developer_reply": "Thanks for your review! And thanks for letting know others!", "developer_reply_date": "January 2, 2022"},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "NeighborsOutlet", "rating": "5", "posted_at": "September 3, 2021", "body": "Good customer service, if you did not receive feedback from the developer, please check \"trash\" or \"spam\" folder in the email.", "helpful_count": "0", "developer_reply": "Glad to hear that!", "developer_reply_date": "September 3, 2021"},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "Lichtadler", "rating": "5", "posted_at": "August 27, 2021", "body": "excellent service!\nalso customer support is super friendly and always easy to reach.\nstore was duplicated in a few minutes", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "LUXX", "rating": "5", "posted_at": "August 8, 2021", "body": "Good app and works well, does what it promises to do. It's great if you need an entire store copied, which is labor intensive and difficult to do without a tool like Duplicate.", "helpful_count": "0", "developer_reply": "Wow, we're so glad to hear that! Thank you for taking the time to write a review.", "developer_reply_date": "March 22, 2022"},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "Nestor Liquor", "rating": "1", "posted_at": "May 24, 2021", "body": "Used the app and it didn't duplicate a ton of products and collections properly. Our store is a mess. Tried reaching out and haven't heard back either to fix it. Would love to get a response and get this resolved but for now this is the case.", "helpful_count": "0", "developer_reply": "Hi, we are sorry about that. We wrote you back to info@nestorliquor.com last Thursday, May 20th. The email was from support@smallvictories.co. Please double-check your inbox as it should be there. In any case, we reviewed your export, and we could see all products and collections have been exported, so we guess the problem might be something else. Probably related with a third-party app integration you might have on your original store? But let's keep the conversation through email. Please reply to our previous email or write us at support@smallvictories.co (with .co, not .com). Thanks and looking forward to having this issue fixed asap.", "developer_reply_date": "May 24, 2021"},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "ShopViajecito", "rating": "5", "posted_at": "March 24, 2021", "body": "Excellent app. Can't make duplicating your store any easier. Customer service was also very quick to respond and efficient!", "helpful_count": "0", "developer_reply": "Thanks for taking time out of your day to leave a review! We're happy you're loving the app. 🙂", "developer_reply_date": "May 5, 2021"},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "Shopitcheap", "rating": "5", "posted_at": "December 19, 2020", "body": "Great app! Had problem importing and the support rep replied in a very short time and resolved the problem. Great!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5559f1d7bae72889c1293b007daf7a4d", "author": "Blad Shop", "rating": "5", "posted_at": "October 28, 2020", "body": "Great app! Had problem importing and the support rep replied in a very short time and resolved the problem. Great!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "torresgaha", "rating": "1", "posted_at": "April 13, 2022", "body": "It is not very good. The price of the items are too high. It cannot help me to see the true value of the product. Thus, $800+ bike is ridiculus.", "helpful_count": "0", "developer_reply": "Hi Torresgaha,\nYou found one of our brand-approved dropshipping products, which are some of our users' favorite products. This is because they have guaranteed minimum gross margins. \nWe welcome you and all JD Sourcing users to check out our growing catalog of brand-approved products here: https://docs.google.com/spreadsheets/d/1mq7tooaIm6QQ8ke07ciHmqpxfzQW3DzlD1LvGDEDA7s/edit#gid=0\nThese are products that D2C brands have approved for JD Sourcing merchants to sell, and most have minimum advertised price (MAP) policies, which you can see in the product listing and Google Sheet.\nFor example, our electric bikes usually sell at minimum retail prices of $1000-2000, meaning our merchants make hundreds of dollars for each sale. Any sales below the MAP price will not ship out, which means no price wars.\nWe welcome you to connect with our support team if you have any questions on how to get the most out of JD Sourcing at support-jdsourcing@jd.com.\nBest,\nAlex\nHead of JD Sourcing", "developer_reply_date": "April 13, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "SSFsports", "rating": "2", "posted_at": "April 10, 2022", "body": "Overall good, the biggest problem is that there is no customer service, no one responds to you, no sense of security", "helpful_count": "0", "developer_reply": "Hello SSF Sports team,\nThank you for your feedback, and congratulations on starting your new store. I believe there's a lot JD Sourcing can do to support your business. To clarify, JD Sourcing's team works Monday - Friday, and we received your request on the weekend. Our team responds to all user requests within one working day, and we look forward to helping you find something you're excited to sell.\nBest,\nAlex \nHead of JD Sourcing", "developer_reply_date": "April 11, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "Turtle and Rabbit", "rating": "3", "posted_at": "April 6, 2022", "body": "It's gonna be much better if they spend more time on their product description pages and product images. Adding the descriptions so the products in the products pool can be more convincing. And the photos are very low quality in most cases.", "helpful_count": "0", "developer_reply": "Dear Turtle and Rabbit,\nThank you for sharing your feedback. We understand this is essential for merchant success, and will continue to invest more into improving the site. In the meantime, we hope you can find attractive products for your new store - please feel free to contact our support team with any questions and they will be happy to support: support-jdsourcing@jd.com \nBest,\nAlex Rudnicki\nHead of JD Sourcing", "developer_reply_date": "April 6, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "Famazing Deals", "rating": "5", "posted_at": "February 21, 2022", "body": "Great app. There's room for improvement, but the customer service is great! I feel like they're doing their best to provide the best service in the industry.", "helpful_count": "0", "developer_reply": "Thank you for the kind feedback, we greatly appreciate it! We'll keep working hard to make the service better and better for merchants.", "developer_reply_date": "April 6, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "The Modus Life", "rating": "5", "posted_at": "January 26, 2022", "body": "This is the next evolution of of ecommerce whether you are dropshipping, white labelling or have a brand! JD provides a Fortune 500 company level sourcing, logistics and super fast shipping. Alex and Kevin have been attentive to every detail in our business and is very much so an extension to our team. They have been extremely helpful in helping us understand what they have to offer and we are highly impressed! This service is exactly what Shopify merchants have been needing for so long but were unable to find. You owe it to your business to install this app and take you store to the next level!", "helpful_count": "0", "developer_reply": "Dear Modus team,\nI want to express our team's appreciation for this review - it means a lot! It's a pleasure to work with exceptional teams such as yours, and we hope to continue earning your trust.\nBest,\nAlex Rudnicki\nHead of JD Sourcing", "developer_reply_date": "April 6, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "Fun & Nifty Gift Shop", "rating": "5", "posted_at": "December 16, 2021", "body": "These guys are AWESOME! Alex has been extremely helpful in helping us understand what they have to offer and we are highly impressed! This service is exactly what US shopify merchants have been needing for so long but were unable to find. The product exclusivity feature is really great and is something other companies don't seem to care about. I guess they just care about moving units and have no concern for the clients they serve. That's certainly not the case here. Do yourself a favor and install this app. It takes product sourcing and 3PL to a whole new level!", "helpful_count": "0", "developer_reply": "Dear Fun & Nifty Gift Shop,\nThank you so much for sharing this feedback - we are grateful for the opportunity to work with you. Our team works hard to support exceptional businesses like yours, and we will continue to do our best to improve.\nBest,\nAlex Rudnicki\nHead of JD Sourcing", "developer_reply_date": "April 6, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "Luminbeam", "rating": "5", "posted_at": "November 18, 2021", "body": "This is the app that saves my store! I own a business just by myself and was frustrated about sourcing and shipping my orders. Then I found JD Sourcing, and they are very responsive and responsible. JD team can help source your product from local suppliers and found the best quality products, and offer much faster shipping than other service agents. Alex is my account manager, and he is very nice and patient. I definitely believe I can gain success with him and the whole team!", "helpful_count": "0", "developer_reply": "Dear Luminbeam,\nThank you so much for sharing this review! We are grateful for the opportunity to support your new business, and excited to see you continue to grow.\nBest,\nAlex\nHead of JD Sourcing", "developer_reply_date": "April 6, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "Get Future Clean", "rating": "5", "posted_at": "November 8, 2021", "body": "This app is amazing and changing the way I feel about dropshipping.This app got me so excited to start dropshipping again and I haven't looked back. The JD team's speed and communication at helping merchants succeed has been amazing. Highly recommend if you are currently drop-shipping or thinking of drop-shipping products.", "helpful_count": "1", "developer_reply": "Dear Get Future Clean,\nThanks so much for your feedback! We're so excited that you've been able to build your business by dropshipping our brand-approved products. Supporting stores like yours are exactly why we launched JD Sourcing, and what keeps us pushing to improve every day.\nTo your continued success,\nAlex\nHead of JD Sourcing", "developer_reply_date": "April 6, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "cuddlypoodle", "rating": "5", "posted_at": "October 18, 2021", "body": "With JD Sourcing, I can be well assured that my products are great quality (as vetted by the JDS team), super quick shipping times, and that I have top notch customer service. Alex and team do everything in their best ability to make sure that you're well taken care off. High recommended!", "helpful_count": "1", "developer_reply": "Dear Cuddly Poodle,\nThank you so much for taking the time to share this kind review. Having the opportunity to support great stores like yours are part of what keeps us pushing to improve and provide the best support every day.\nCheers,\nAlex\nHead of JD Sourcing", "developer_reply_date": "April 6, 2022"},
{"app_id": "9df901fec611c68610e1c6b51c62b676", "author": "Kittykatclub", "rating": "5", "posted_at": "September 24, 2021", "body": "This service is great. As soon as I saw JD I knew that I could trust the supply chain and quality of the service. I'm able to source and fulfill products from their overseas warehouses as well as from China, which is great. Having the option to source my own products and have JD take care of all of the fulfillment is great. Their product pool seems to carry things I don't see on other services. It's small, but at least I can trust everything is real and good quality - and with better fulfillment times. Looking forward to them filling out their product pool more, but in the meantime the custom sourcing service+overseas warehousing is a game changer.", "helpful_count": "0", "developer_reply": "Dear Kittykatclub,\nThank you so much for writing this review of our service. We founded JD Sourcing with the goal of serving great businesses like yours, and look forward to continuing to support you in the future.\nCheers!\nAlex\nHead of JD Sourcing", "developer_reply_date": "April 6, 2022"},
{"app_id": "6a703af383a8cf10a8bfc4fc33fa4f74", "author": "Uniqueful", "rating": "1", "posted_at": "March 14, 2022", "body": "Really promising but I receive no contact from Custom Gateway and upon reaching out to the support team was told the app is not available unless you are an enterprise and pricing starts from £2000 to just “install” the app. Completely misleading as the documentation says this service is free of charge and you pay a small fee per order.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "SangareeXP", "rating": "1", "posted_at": "June 12, 2020", "body": "App stop working suddenly absolutely no customer service even via email you will not get a response ..please do not install this app it will break your website", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "ExcellentSupply.com", "rating": "2", "posted_at": "November 4, 2021", "body": "Big disappointment. I was hoping for a way to add some nice tables to descriptions. But this was a waste of $30.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "Chideno Canada", "rating": "5", "posted_at": "July 4, 2021", "body": "Seen it in action with the Supply theme and it was great. Easy to install and use right from the product page.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "Ocho Select", "rating": "5", "posted_at": "April 20, 2022", "body": "I needed a flash sale banner for my client, so I created a design seamlessly! However, I wasn't seeing the banner when I would check my site. I contacted their live chat and Ella immediately fixed the issue and even showed me the simple correction for what happened! Definitely recommend!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "Melania Gorini Jewellery", "rating": "5", "posted_at": "April 17, 2022", "body": "Ho usato questa app per creare un banner per informare i miei clienti della possibilità di pagare in 3 rate. Devo ammettere che ci sono ancora delle cose da migliorare, all'inizio il pop up non funzionava come speravo ma do 5 stelle per l'assistenza fenomenale ricevuta per risolvere il problema (il giorno di Pasqua tra l'altro!) L'assistente è stata disponibilissima ed ha risolto i miei problemi, grazie mille!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "50a52605ddce8f75af82b26c279f5843", "author": "Couples Collections", "rating": "5", "posted_at": "December 8, 2021", "body": "Just started using Store SEO and I'm very impressed. Excellent UI and clear design and directions. Perfect for someone like me who knows nothing about this but wants to improve.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "50a52605ddce8f75af82b26c279f5843", "author": "Royalties with IDILIMLY/LOR", "rating": "5", "posted_at": "November 26, 2021", "body": "website is cool now it just doesn't load at all sad i been using this app for months and storeseo was the best one now it doesn't even go to home page without erroring out please fix the app it should work perfectly for business", "helpful_count": "0", "developer_reply": "Thanks for reaching out to us. We've just fixed this issue in our App so it wont happen again. I believe our support team already informed you regarding this.\nFeel free to reach us when you need any help.\nHave a good day!", "developer_reply_date": "November 26, 2021"},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "DJ TechTools", "rating": "1", "posted_at": "June 11, 2020", "body": "No longer works. Shows HTTP Error 500 when trying to access the app and clicking on the login button on the frontend does nothing.", "helpful_count": "2", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "DigiverseStore", "rating": "5", "posted_at": "December 21, 2018", "body": "Well the thing works very well but i would like to appreciate the detailed explanation and suggestion to where to put the code of developers. I see some developers says put the code in this file but the question is where. So they explain it very plainly. Thank you guys.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "Gunskins", "rating": "5", "posted_at": "August 31, 2018", "body": "It's great to see the integration from our Amazon Seller Account. The metrics show how many signs ups were successful.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "Pallenium", "rating": "5", "posted_at": "August 7, 2018", "body": "I like it bkjbkjbgkgjgjgk hgjhgj jvghjvj jbkjb", "helpful_count": "3", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "Flower Box Wall Gardens", "rating": "5", "posted_at": "July 20, 2018", "body": "This is great application, love the features", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "CSB-Coventry", "rating": "5", "posted_at": "April 16, 2021", "body": "Fantastic app. It makes my product pages so much neater. I had a slight issue that support quickly resolved in a matter of hours. Incredible support. Really happy with this app. Surprised at some of the poor feedback about support from other people - I found them to be excellent and really quick too.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "iSupplies.ca", "rating": "1", "posted_at": "February 2, 2021", "body": "does not work waste your time and money, and very poor customer service\ngood luck, with DescriptionTable", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "'Choleture", "rating": "5", "posted_at": "March 31, 2019", "body": "This is an incredibly useful app for individuals who are looking for clean well formatted table style descriptions without having to convert to HTML.  The installation was seamless with zero complications and you simply enter the data you want to show on your website into each line of the table.  Very simple and user friendly would definitely recommend to anyone who wants to do it themselves without dealing with html coding.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "Rc District", "rating": "1", "posted_at": "May 13, 2017", "body": "I expected better support from this developer. Support had me add them as staff so they could review the setup. They logged in once and I never heard anything back from them. I gave them a week before I deleted them as staff and two weeks before I left this feedback. We have goals go achieve and time is of the essence.", "helpful_count": "6", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "The Melbourne Vent Company", "rating": "5", "posted_at": "March 21, 2017", "body": "Great little app for making neat and presentable tables for your products.\nFantastic customer support also!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "S&B", "rating": "5", "posted_at": "April 11, 2022", "body": "Application facile à utiliser, et support client super réactif il répondent très vite et vous aide à mettre en place vos pop up ! Je recommande", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "Fragrancebuy.ca", "rating": "5", "posted_at": "February 9, 2022", "body": "Because offers a unique set of tools which have helped us spice up our product pages. They have a beautiful and intuitive UI and their banners speak for themselves. On top of all this, they have a great team that is extremally helpful, shoutout to Ash and the team!", "helpful_count": "0", "developer_reply": "Thanks for the review! It's been so awesome working with you guys to get set up! Love to see all your dynamic product page content now working flawlessly for you guys without code. \n-Ashland, Founder", "developer_reply_date": "February 14, 2022"},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "Ashour Shoes", "rating": "5", "posted_at": "February 8, 2022", "body": "Super cool apps with many great features and designs, and most importantly is that the support team is always available and are very helpful", "helpful_count": "0", "developer_reply": "So glad you've had an awesome experience- thanks for the review!\n- Aya, Customer Success", "developer_reply_date": "February 14, 2022"},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "itzoo", "rating": "5", "posted_at": "February 4, 2022", "body": "This is one of the best apps I have used with Shopify. The support has been great and very quick! I needed some customisations and the team were able to assist quickly and efficiently. Thank you!", "helpful_count": "0", "developer_reply": "So glad you've had an awesome experience- thanks for the review!\n- Aya, Customer Success", "developer_reply_date": "February 14, 2022"},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "BMBSHLL", "rating": "5", "posted_at": "February 2, 2022", "body": "Really a great app for boosting your sales. Customer service have always been on point, helpful, right there. Very happy with it! Thanks!", "helpful_count": "0", "developer_reply": "Thanks so much for the review- we're so glad you've been enjoying Because!\n-Arsal, Customer Support", "developer_reply_date": "February 3, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "Peachy Athletic", "rating": "5", "posted_at": "April 19, 2022", "body": "Recently switched over from Rivo and really impressed so far! I love the additional functionality that this app gives. It also allows VIP tiers without charging you an arm and a leg per month. And not to mention top notch support! Alex has pretty much held my hand through this whole process (even though it was seamless and easy to start, just a few hours to set up) - he’s been by my side the entire time and ensured a seamless transition from our old app. Imported all of our customer data and helped me get to production quickly!!! I’m impressed so far!", "helpful_count": "0", "developer_reply": "Dear team atPeachy Athletic❤️,\nWe’re blown away by your kind words 🥰! Your words lifted our spirits today. It means so much to us when our customers appreciate the hard work that goes into making each day at Growave memorable✨.\nThanks again, and have a wonderful day ❤🤗!", "developer_reply_date": "April 19, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "es16.dk", "rating": "5", "posted_at": "April 19, 2022", "body": "Fantastisk service. Hjælper altid når der problemer. Svare hurtig og præsis på tingene så tingene er til at løse", "helpful_count": "0", "developer_reply": "Hey Thomas✨, \nThank you for this great and valuable feedback. It means a lot to our whole team and we are happy that we were helpful to you😊! \nWe do really appreciate your time and such a kind customer like you help us to improve and your warm words motivate us to better our service and app. We will do our best to continue providing the best service ever🥰!", "developer_reply_date": "April 20, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "tarallificiosantabarbara", "rating": "5", "posted_at": "April 19, 2022", "body": "questa app mi ha dato la possibilità di far scegliere i prodotti da inserire nel bundle, funziona e fa quello che serve", "helpful_count": "0", "developer_reply": "Thank you so much for your great & valuable feedback. :)  \nFor any queries, feel free to contact us through in-app chat or email us at hello@thimatic.com, we are always happy to help you.", "developer_reply_date": "April 19, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "Premium Crafted", "rating": "5", "posted_at": "April 18, 2022", "body": "This app has very helpful to get bundles on our site, and despite a few bugs the customer support has been excellent! We're very happy with how it turned out.", "helpful_count": "0", "developer_reply": "Thank you for sharing your valuable experience with our app and service!\nIt means a lot to us. :)\nFor any queries, feel free to contact us through in-app chat or email us at hello@thimatic.com, we are always happy to help you.", "developer_reply_date": "April 19, 2022"},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "Marcies Vintage Toys Crafts And More", "rating": "5", "posted_at": "June 22, 2018", "body": "a great asset to my shopify store!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "Kayvarstore", "rating": "5", "posted_at": "June 19, 2018", "body": "Does exactly what it says and i have to admit that the video tutorial's completely brilliant! did some small changes on my own and everything works. There is some work you have to do on your end but the instructions are darn clear. In fact, i think they cannot be any clearer. Set up took about 20-40 mins including all the registration on amazon's end but it's well worth it!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "Espace Coffee", "rating": "5", "posted_at": "May 31, 2018", "body": "we love this app.. especially it's free and it works as promised.. so far we haven't had any complaints..\nthanks a lot", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "fd157b1cbcb28c947f7e15ef9cf7401e", "author": "Socheap89", "rating": "5", "posted_at": "March 20, 2018", "body": "Good app and easy to integrate", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "70304850b4167148243f4b27014a78cc", "author": "Rays Jewellery", "rating": "5", "posted_at": "August 16, 2016", "body": "Great app and great support! Makes everything that more tidy.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "Leona Brava Organic", "rating": "5", "posted_at": "January 24, 2022", "body": "Really like this app! so happy to install it to our store :) highly recommended! The support is very helpful !!!", "helpful_count": "0", "developer_reply": "Thanks so much for the review- we're so glad you've been enjoying Because!\n-Arsal, Customer Support", "developer_reply_date": "February 3, 2022"},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "Dermetech", "rating": "5", "posted_at": "December 21, 2021", "body": "Great customer service - awesome app. I installed the app and I had a little issue, customer service responded almost instantly and fixed the issue in less than 5 min. I recommend this app.", "helpful_count": "0", "developer_reply": "So glad we were able to support you! Let us know if you ever need anything else and good luck customizing all your product pages :)\n- Jonathan, Product Success", "developer_reply_date": "December 23, 2021"},
{"app_id": "5ecd9bb6f5756ebf3b9b3dcc974740e4", "author": "William Wood Mirrors", "rating": "5", "posted_at": "December 20, 2021", "body": "Fantastic app. What we really love about Because is the ease of displaying our companies USP's in the product page. The app's very easy to understand and navigate, it also has plenty of helpful information for your consumption should you have any problems. Keep up the good work guys!", "helpful_count": "0", "developer_reply": "Thanks for the review William Wood Mirrors team! \nI'm glad you've been able to emphasize your unique selling points on each of your product pages using Because! It's been awesome to see how you've grown your use of the app since we met you way back in the day. \nWe can't wait to continue supporting you on your journey to personalized product pages. Cheers! \nAshland, Founder & CEO", "developer_reply_date": "December 20, 2021"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "East Meets West USA", "rating": "1", "posted_at": "April 18, 2022", "body": "Had one of the worst experiences with this app. Couldn't even begin to describe the months of back and forth while we helped them solved coding issue, fix crucial bugs and glitches. There is WAY too many codes that Growave implements on your site, 30+. This causes website to be slow and the user experience to be horrible. We upgraded our theme and deleted all the Growave codes because we were going to delete the App. Somehow we noticed that there was Growave code in the new theme! How it got there is highly suspicious. We deleted that App immediately after that. Over all this app is very novice in terms of functionality.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "Your J Beauty", "rating": "5", "posted_at": "April 18, 2022", "body": "Smooth communication and great support ! An all-in-one app for useful features for an e-shop. I personally recommend. Looking forward for the further Growave development.", "helpful_count": "0", "developer_reply": "Hey Your J-beauty team, \nThank you very much for your kind words 😍.\nWe truly appreciate you as our customer, thank you for using our app and leaving such a positive review ✨.\nWe take every feedback into account because our customers are the number one priority to all of our staff 🙌.\nWe are glad to be helpful to you and we are always happy to help you 😊.   \nOnce again we are grateful for clients like you and hope you stick with us for years to come 🤗!", "developer_reply_date": "April 19, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "Beautinow", "rating": "5", "posted_at": "April 16, 2022", "body": "I would say Growave is the best loyalty/review/wishlist app in the market. With Growave, you don't need to download five different programs simply to get one feature, and you'll save a lot of money in the process. Aside from that, the app developer will always be happy to assist you in customizing the app to better match your theme. Fast, accurate, personable, and patient customer service. Incredible app.", "helpful_count": "0", "developer_reply": "Hi darling, Beautinow,\nWe really appreciate your warm words 🌷!\nThank you for sharing your thoughts with us. It is a great joy for our whole team that you love our features and highly appreciated our customer service. 😊 Your praise gives us the motivation to provide service with great pleasure🙌🏻!", "developer_reply_date": "April 18, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "AccGamer", "rating": "5", "posted_at": "April 13, 2022", "body": "Greatest apps i've ever installed, support also fast and to the point for my problem and trouble, I love it :D", "helpful_count": "0", "developer_reply": "Hi AccGamer Team😇,\nYou are awesome!😊Thank you so much for your kind words and for the wonderful review. We greatly appreciate you using our app. We listen to our customers because you are all important to us, and it is our great pleasure to help you with your concerns. Once again, thanks a lot for leaving such a positive review. Let us know anytime if there's anything else we can be of service💕\nBest wishes,\nGrowave Team😇", "developer_reply_date": "April 13, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "Nordic Plug", "rating": "5", "posted_at": "April 13, 2022", "body": "Good app - many functions in one APP. Will decrease your APP clutter. Maybe the best support I have ever encountered.", "helpful_count": "0", "developer_reply": "Dear team at Nordic Plug❤,\nIt makes our day to hear that we were able to provide you with 5-star service✨. We’ll make sure the entire team receives your feedback – they’ll be thrilled to hear your kind words. Thank you so much for choosing Growave❤️!", "developer_reply_date": "April 13, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "Born Nouli", "rating": "5", "posted_at": "April 14, 2022", "body": "Great app and support was quick and super helpful. Easy to use and any problems and the guys are on hand to get any tweaks or problems sorting quickly.", "helpful_count": "0", "developer_reply": "We’re delighted to hear that you are happy & satisfy with our app features and our service. Thank you very much for the great feedback.\nDo get in touch with us for any queries through in-app chat or email us at hello@thimatic.com, we are always happy to help you.", "developer_reply_date": "April 15, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "Aroxfitness", "rating": "5", "posted_at": "April 13, 2022", "body": "Great app and great support. We use it for our bundle deals. We had some problems but the support fixed it within 10 minutes. thanks.", "helpful_count": "0", "developer_reply": "Thank you for your valuable feedback, it’s always rewarding to hear kind words. :) :)\nFor any queries, contact us through in-app chat or email us at hello@thimatic.com, we are happy to help you.", "developer_reply_date": "April 15, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "Abela Online", "rating": "1", "posted_at": "April 9, 2022", "body": "We unfortunately chose the Thimatic’s Upsell app to sell our a-la-carte product in our store. This is undoubtedly the worst Shopify app available today (we use 33 other apps). So many blunders from the development team. They will randomly take their app offline to work on it without any communication to the client during PEAK ordering hours. The result? A big fat “404 Page not found” error for our valued customers. Total lack of communication among the app developer’s OWN STAFF. One of the team members will say the app is working fine and ask for a meeting for us to simulate the error (despite sending multiple screenshots/recordings to them). After showing the error in real time during the meeting to another team member “Mr. Jack”, he says this error is to be expected since they are working on it! So why call a meeting to show the error is happening? We would have given a negative star rating if there was such a thing.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "Wrestlinggaphics.com", "rating": "5", "posted_at": "April 5, 2022", "body": "The customer service was great. They helped me set up the code for the app and place the bundles in the location I wanted in my store. Great so far.", "helpful_count": "0", "developer_reply": "Thank you so much for such a great review. It encourages us to continue making improvements to our app. :)\nIn case of further assistance, feel free to contact us at hello@thimatic.com or via our app-in chat.", "developer_reply_date": "April 5, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "Mii-Estilo.com", "rating": "5", "posted_at": "April 1, 2022", "body": "Great app so far, only just installed it but can make exactly what is needed. Support works very well and is very quick to help.", "helpful_count": "0", "developer_reply": "We’re grateful for your valuable feedback. It’s our pleasure to provide the best possible service to our customers.\nFor further queries please contact us at hello@thimatic.com or via our in-app chat. We are always happy to help you.", "developer_reply_date": "April 3, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "NAMELY CO", "rating": "5", "posted_at": "March 30, 2022", "body": "This is hands down the best Bundle + upsell APP on the market The customer service is next level! I literally searched hundreds of apps before i found this one! BEST IN THE BIZ!!!", "helpful_count": "0", "developer_reply": "Thank you for finding great value in our app and our support. And our special thank you for recommending our app. It’s great to hear that you had a positive experience with us.\nIn case of further queries please contact us at hello@thimatic.com or via our in-app chat. We are always happy to help you.", "developer_reply_date": "March 30, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "Shapewear USA", "rating": "5", "posted_at": "April 12, 2022", "body": "Growave offers excellent support. Especially Alex among others who has been helping us with getting our website perfect. I have been using Growave for Reviews, Wishlist, Instagram Shopping, Social Login and Rewards. Definitely the most understanding support team that I have ever come across in this space. Growave as an app is good and integrates well with our theme. We of course would like some additional features, and Growave is working with us to accommodate this. I think if this keeps up we will definitely keep this app for the long haul. Thanks Growave!", "helpful_count": "0", "developer_reply": "Hiya!🥳\nThere are not enough words to express my gratitude towards you team at Shapewear USA,\nYou have been always cooperative and amazingly patient and it was only our pleasure to fulfill your requirements. We highly value your feedback and would love to let you know that we are trying hard to get things keeping up all the time. \nIt is true that we only get motivated by these insightful review, thank you so much for that. ❤️\nAspire to serve you in excellent manner every single day!", "developer_reply_date": "April 12, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "Plantish", "rating": "4", "posted_at": "April 12, 2022", "body": "Haven't implemented the app on our live store yet, but the customer service have been helpful. I will say there is a few delayed responses, but we usually get my problems solved.", "helpful_count": "0", "developer_reply": "Hi team at Plantish,\nPlease accept our deepest gratitude for leaving a fabulous review and contributing your time to our growth! 😇\nIn our field our beloved merchants are foremost and therefore your feedback is highly appreciated by us. \nWe are extremely grateful to you for choosing us and we are even more pleased to hear that there is a room for improvement and we promise that we will work hard on this point to polish it till perfection. Thank you so much for letting us know. 🤩\nPlease reach out if you have any questions, we’d love to chat with you!", "developer_reply_date": "April 15, 2022"},
{"app_id": "b231063b96f902e372ac236bf3479bf7", "author": "Broker Leather", "rating": "5", "posted_at": "April 12, 2022", "body": "I'm not super tech-savvy, so being able to reach out to support for assistance has been very helpful. I like having all of these features within one app to retain loyal customers.", "helpful_count": "0", "developer_reply": "Howdy😇!\nOur whole team appreciates you for granting us with your cosmically cool review team at Broker Leather. We are gratified for the happiness of assisting you❤️.\nMore importantly, we are extremely grateful to you for choosing Growave. May you provide us with enough opportunities to serve you once again🎊.", "developer_reply_date": "April 12, 2022"},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "Color Confidence", "rating": "5", "posted_at": "March 29, 2022", "body": "Really appreciate the support they provide and how quickly they've resolved any issues. Their tech team is great, very reliable.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "9a89682644bce3a7edd237912ddf1dd5", "author": "GreenTeaEveryday", "rating": "5", "posted_at": "March 29, 2022", "body": "We've been using this app for six months now. The most useful feature for us is Build Box (Customers can build their own box from the list of products).\nSupport service works flawlessly :) Of course, I would like to see further expansion of the application's capabilities. For example, functions such as:\nSpend Amount - Get Discount, General Discount, Cart Discount. We wish success to the developers :)", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "42427f322f69d184d03bea59c058d20e", "author": "Big Dog Bed Company", "rating": "2", "posted_at": "January 27, 2022", "body": "The app is simple to use, but does not allow the user to do very basic tasks without the intervention of the support team. Font cannot be changed, the position of H2 in the body of the tabs cannot be adjusted and the default position is completely inappropriate, closer to the paragraph above and much too great a distance from the paragraph to which the title relates. The support team is helpful and attentive, but it should be not be necessary to get them involved in very basic activities of using the app. The app is underdeveloped and should not have been released", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "42427f322f69d184d03bea59c058d20e", "author": "Barefoot Artisan Soap Co", "rating": "5", "posted_at": "January 12, 2022", "body": "This app is soooo easy to use and it actually does what it says it will without having to embed code or make a bunch of modifications to fit my page. I ended up buying the full version because I needed many different tabs on many different products because we don't drop ship, our items are handmade and each unique with unique ingredients. But because I can customize each tab, I can have a neatly laid out product pages on Shopify now instead of a bunch of necessary information that customers have to sift though about our skincare products that they might not care about or want to read but that I think is good info for them to know. Now, they can choose what information they want to know, and it's up to them to decide if they want to read it but for my peace of mind, it's there but not junking up the page now. This product is PERFECT for beginners or people who have an online business but don't know all the ins and outs of embedded code or page placements or app size modifications and want to see their changes in real time when they're doing it so that they can make sure that they're doing it correctly and not making a bunch of mistakes that they'll have to change once they publish the page. The tabs are straightforward without a bunch of time consuming choices to have to make. If you're like me, you want a product that doesn't have million things to choose from because either you get overwhelmed at the amount of choices or you waste a lot of time trying to tweak the look of your page that could be spent on more important things for your business or you make a bunch of mistakes because you don't know what you're doing! This app makes the process easy because it is limited. So, if you're looking for a fancy app that's going to suck up all your time trying to build a few tabs on your pages with a million choices for font, color, design, etc, then this app isn't for you. Or if you know what you're doing or you have a degree in website design or html code or something, then this app isn't for you, but if you have better things to do with your business besides create tabs or don't really know how to use tabs on your website pages or any fancy stuff because you are a beginner or are just not website or computer savvy, then get this app! You'll be soooo glad that you did! Oh and the customer service is awesome too!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "42427f322f69d184d03bea59c058d20e", "author": "Your Mindful Treasures", "rating": "5", "posted_at": "October 6, 2021", "body": "I used this to add drop down menus to my product. Works really well! only thing i would change is that you cannot move the drop downs into the description, only above. I contacted them for assistance and they got back to me in seconds. Very Happy", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "42427f322f69d184d03bea59c058d20e", "author": "BijouxBio", "rating": "5", "posted_at": "October 4, 2021", "body": "Allows you to place chosen amount of tabs in a location of your choice. Definitely worth the value. Used the free plan for a week, then upgraded. The tab functionality is smooth, and easy. The design options are well thought out. Support have responded within less than 24hrs and have been helpful with questions.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "9d256ce0489ef3d3d5bc18466f41a03d", "author": "MAYONEUR", "rating": "5", "posted_at": "April 22, 2020", "body": "Perfect store locator. Good app. The owner of the app is a very helpful person if you have problems with it. Should advise this to more stores.", "helpful_count": "0", "developer_reply": "Hey there,\nsorry to hear you're having issues with my app.\nI'm always happy to help you if you email me at support at awesomestorelocator.com.\n1) I've removed the \"Powered by\" text from your locator.\n2) Your map doesn't show, because you have to enable some APIs as described in the setup guide:\nhttps://www.awesomestorelocator.com/google-maps-api-key-instructions\nAgain, I'm more than happy to help you via email support.\nI'll also email you this reply.\nBest,\nPeter", "developer_reply_date": "April 1, 2020"},
{"app_id": "9d256ce0489ef3d3d5bc18466f41a03d", "author": "Apomat Candles", "rating": "5", "posted_at": "December 11, 2017", "body": "super speedy support for this app! I used the wrong API selector as I have zero experience in this and they helped me figure out where I went wrong within no time the app was set up the exact way I wanted it! I tried another app before this one and quickly uninstalled it after trying this one! worth it!!!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "Broseus & co", "rating": "5", "posted_at": "March 25, 2022", "body": "Really good I had a problem with an order, I installed the app after the order was placed so the app could not detect it. Customer support helped me identify that the order was fraud. Thank you", "helpful_count": "0", "developer_reply": "Thank you for the great feedback, it's highly appreciated! \nWe're checking the orders in real-time as they come in. For this, SEON has to be installed to be able to run the fraud check.\nHowever, we are always looking for ways to help the merchants stay protected, so we're happy to provide insights for past orders as well.\nWe'll fight fraud together! 👊", "developer_reply_date": "March 25, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "All Best Beauty", "rating": "5", "posted_at": "March 21, 2022", "body": "I just added this app today, have no comment on the fraud prevention yet.\nBut the customer service experience is really great till now. Thank you, Walter", "helpful_count": "0", "developer_reply": "We are glad to see your feedback. Our goal is to provide the best customer service and it's lovely to see your appreciation. 😍\nLet's fight fraud together! 👊\nAll the best, \nWalter", "developer_reply_date": "March 21, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "MOSKBITE", "rating": "5", "posted_at": "March 21, 2022", "body": "This app is a game-changer to prevent online fraud. I had many charged-back due to credit card fraud but the SEON app helps to prevent fraud with immediate results. In fact, the customer's service is very good. They are always online to help. I highly recommend the App.", "helpful_count": "0", "developer_reply": "Thank you for the review! We appreciate your kind words and are happy to help your store in preventing future fraudulent orders and chargebacks. \nWe'll fight fraud together! 👊", "developer_reply_date": "March 21, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "Lindsey Foard", "rating": "5", "posted_at": "March 10, 2022", "body": "Love the added protection against chargebacks with this app and you can't beat the support! I definitely recommend adding it to any online shop.", "helpful_count": "0", "developer_reply": "Thank you for the feedback, we appreciate it! 😍\nWe're glad to protect you against chargebacks and more than happy to help at any time. We'll fight fraud together! 👊", "developer_reply_date": "March 10, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "Shop First Choice S.A", "rating": "5", "posted_at": "February 17, 2022", "body": "Great App with an easy-to-understand UI. It is very straightforward in what it sets out to do and does it well. Also has some great customization tools and great support! Walter is and was extremely helpful with everything. Thank you! You deserve more reviews!", "helpful_count": "0", "developer_reply": "Thank you for the review, we love to hear your feedback! 😍\nWe're happy to help. We'll fight fraud together! 👊", "developer_reply_date": "February 17, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "EasySMX", "rating": "5", "posted_at": "February 17, 2022", "body": "SEON support team very good, online timely solutions to many of my problems.My store recevied Fraud order every week, also suffered a lot of losses,so I desperately needed a powerful App like Fraud fighters.", "helpful_count": "0", "developer_reply": "Thanks for the feedback, we highly appreciate it! We're happy to help you fight against fraud. 👊", "developer_reply_date": "February 17, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "95gameshop", "rating": "5", "posted_at": "February 16, 2022", "body": "Just the best app support on all Shopify Market. Walter was with me for any support I required and also consult me due to security system", "helpful_count": "0", "developer_reply": "Thanks for the great feedback! You're right, we aim to provide the best support experience. I'm always happy to help. 👊\nCheers,\nWalter", "developer_reply_date": "February 16, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "Your Champagne Lifestyle", "rating": "5", "posted_at": "February 16, 2022", "body": "East set up, nice app. Had a question i needed help with and chatted with Walter. He answered straight away and was so helpful. Really appreciate it, thanks.", "helpful_count": "0", "developer_reply": "Thank you for the review! It's great to hear you loved the seamless experience we aim to provide for customers. We're always happy to assist and any question is welcome. Our goal is to help you stay protected. \nThanks for choosing SEON! 👊", "developer_reply_date": "February 16, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "Lpkyfurniture", "rating": "5", "posted_at": "February 14, 2022", "body": "I highly recomend this app. It has already saved me money by detecting fraudulent orders. The support is amazing here. I had some questions and Walter was able to connect me to a Zoom call and explain me everything and show me how things work. Do not hesitate to install!", "helpful_count": "0", "developer_reply": "Thank you for the review, we love to hear your feedback! 😍\nWe are always happy to help and assist businesses in protecting their shop. We'll fight fraud together 👊", "developer_reply_date": "February 14, 2022"},
{"app_id": "39056dc0ad007ee4e32cb1a26696487d", "author": "Besafe1st™", "rating": "5", "posted_at": "February 8, 2022", "body": "Very helpful the support today verifying few topics related to the app. After being clear we have moved forward with the free plan service for now. As new here, we believe all will be great and peaceful for our Business having SEON. Fraud Fighters. Thank you,\nMartin\nBS1", "helpful_count": "0", "developer_reply": "Hey Martin, thank you for the awesome review, we highly appreciate your feedback! We're always happy to assist and provide the best support possible. \nOur goal is to help merchants fight fraud and we believe great support is a must for the best experience. \nWe're happy to help on this journey and protect you! 👊", "developer_reply_date": "February 9, 2022"},
{"app_id": "5f0813d366b127f24fea6d61066b3a62", "author": "CLASSY NERDY CHIC", "rating": "5", "posted_at": "December 18, 2020", "body": "I downloaded the app with ease. It was a straightforward setup and easy to use for customers. The company is very responsive and was open to suggestions.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "76c965f148eebebb535d4496aedab3cd", "author": "ooohne", "rating": "5", "posted_at": "March 25, 2022", "body": "Wir haben die App nun seit einiger Zeit in Gebrauch und sind wirklich überzeugt. Gerade einige Schwächen in den Bereichen SEO und Code hatten wir noch nicht entdeckt. Klare Empfehlung!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "76c965f148eebebb535d4496aedab3cd", "author": "Trelino® Composting Toilets", "rating": "5", "posted_at": "March 8, 2022", "body": "Gave this app a shot and it worked very well for me. It gives you a to do list that you can work on. It was in general very interesting to get an overview of my stores performance. And support is great, very quick to reply and very friendly.", "helpful_count": "0", "developer_reply": "Thank you for your review. It's already on our roadmap that some resulting tasks will be solved by the app for you. We expect to have the first \"automatic fixes\" ready at the end of the year.", "developer_reply_date": "March 9, 2022"},
{"app_id": "76c965f148eebebb535d4496aedab3cd", "author": "VANLIV", "rating": "4", "posted_at": "March 8, 2022", "body": "Having all audits in one overview is really really handy. Missing some more details about the errors, but it's already very helpful. Thanks for the free check!", "helpful_count": "1", "developer_reply": null, "developer_reply_date": null},
{"app_id": "63d6792914b1250e8cea38de0fc3a9c9", "author": "Adika IL", "rating": "5", "posted_at": "April 7, 2022", "body": "AMAZING APP! BOA the app developer helped us with each request that we had.\nthe app integrates smoothly with checkout!", "helpful_count": "0", "developer_reply": "THANKS! Enjoy the app ❤️", "developer_reply_date": "April 7, 2022"},
{"app_id": "63d6792914b1250e8cea38de0fc3a9c9", "author": "מילות מעוצבות", "rating": "5", "posted_at": "October 24, 2021", "body": "האפליקציה עובדת נהדר! כמו כן היא מאוד הכרחית וכמעט שלא ניתן לאפשר ללקוחות חווית קניה בלעדיה. מוצר מצויין! שירות לקוחות מצויין!. תודה. The app works great! It is also very necessary and it is almost impossible to allow customers a shopping experience without it. great product! Excellent customer service !. Thanks", "helpful_count": "0", "developer_reply": "Thanks for this great review! We're happy to hear that you're enjoying the app and that it's improving your customers' shopping experience. Let us know if you ever have any trouble or think of any new features you would like to see.", "developer_reply_date": "October 31, 2021"},
{"app_id": "63d6792914b1250e8cea38de0fc3a9c9", "author": "Hampibag", "rating": "5", "posted_at": "June 9, 2021", "body": "האפליקציה עובדת מדהים, מאפשרת בצורה נוחה ללקוח לבחור נקודת איסוף קרובה לכתובת שהזין וזה עובד מושלם. בנוסף הצוות מאחורה תמיד שם לתת תמיכה, לפתור בעיות, ללמוד ולהשתפר. ממליץ בכל אתר", "helpful_count": "1", "developer_reply": "Thanks for your kind review - we're so glad that you're enjoying PickMeUp. If there's a feature you think is missing or ever have an issue, we're here to help!", "developer_reply_date": "June 21, 2021"},
{"app_id": "63d6792914b1250e8cea38de0fc3a9c9", "author": "Meydalle", "rating": "5", "posted_at": "May 4, 2021", "body": "חיכיתי הרבה זמן לאפליקציה הזאת. היא מעולה!!\nנוחה לתפעול וחוסכת הרבה זמן וטעויות.\nמאפשרת חוויה טובה ונוחה ללקוחות שלי (וגם לי)\nתודה רבה", "helpful_count": "1", "developer_reply": "Thanks for your kind review - we're so glad that you're enjoying PickMeUp. If there's a feature you think is missing or ever have an issue, we're here to help!", "developer_reply_date": "June 21, 2021"},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "Magic Spoon", "rating": "5", "posted_at": "September 1, 2021", "body": "Brightflow has been incredibly helpful in delivering realtime, actionable business insights to our team. Robbie and team are responsive and diligent and the product is great!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "Fellow", "rating": "5", "posted_at": "August 25, 2021", "body": "Brightflow delivers weekly reports on the breakdown between our ecommerce platforms to help deliver reliable and speedy insights that would otherwise take us hours to retrieve.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "Cute Pots Plants", "rating": "5", "posted_at": "October 22, 2020", "body": "Love this app for two reasons! Great customer service, thanks Robbie and team! It has saved me tonnes of accounting time and given me back about 30 minutes of every day. I am so thankful for this!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "Newmans Leathers", "rating": "5", "posted_at": "October 21, 2020", "body": "Amazing app. Amazing customer service. This app provides those extra cash flow and profit that would have otherwise been lost. Thanks for your help and a great team.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "The Spices", "rating": "5", "posted_at": "October 20, 2020", "body": "The ability to create scenarios on top of our baseline budgets is invaluable when it comes to making business decisions. Will recommend this app for all Shopify users.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "Happy Wax", "rating": "5", "posted_at": "September 14, 2020", "body": "Highly recommend Brightflow!  They have changed the way we think about our cash flow.  In the day-to-day, we can get a real-time picture of our actual cash flow without waiting for month-end.  And for the longer-term, their projections give us a multi-year view that helps us better plan for growth.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "P.S. Good Times", "rating": "5", "posted_at": "September 14, 2020", "body": "Using Brightflow, we were able to get our Accounts Receivable from over 100 days to ~40 days. Pretty darn cool. \nAnd now we have a much better sense of our cash flow and can foresee issues before they happen. Love this app.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "a4c82d5419aada510329ce0eb4aa37a2", "author": "The Flex Company", "rating": "5", "posted_at": "September 10, 2020", "body": "So much to say, but the main upside we've found is:\n1) we used to rely on Google sheets to manage finances and it took forever for our books to close. Now we can assess our business MUCH faster on an ongoing basis \n(2) the app helps us preserve cash by reducing our working capital needs\n(3) Brightflow actually monitors and predicts potential issues, which has saved us, especially now as we're focused on safeguarding liquidity", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Medicali Wholesale", "rating": "5", "posted_at": "April 19, 2022", "body": "2 years with Flits and what an amazing team to work with, This app not only completely changes the look and feel for the customer, but adds so many features I did not have before like the Store credit feature,Referral Program, Earning rules, Spendings rules and much more. The support team is what puts this app over the top. They are dedicated to every site that uses their apps and personally helps them with any questions,set-up and beyond! They really outdid themselves on the DUO + UNO upgrades! No one compares! Thank you Flits!!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Candidpot.com", "rating": "5", "posted_at": "April 15, 2022", "body": "Excellent and prompt customer service. That's something they're incredibly good at. Keep up the good job, guys, because your ability to customise and reply quickly is incredible.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Flora & Curl", "rating": "5", "posted_at": "April 4, 2022", "body": "Fantastic and responsive customer service. They are really great with that. Keep up the great work guys, because your ability to offer customisation and be quick to respond is amazing.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Tea Life", "rating": "5", "posted_at": "March 21, 2022", "body": "Good service if there is something wrong, and seem to be invested in their product with updates and new features.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Equipement Sverige", "rating": "5", "posted_at": "March 21, 2022", "body": "We got all the help we wanted and it woked really good! We can really reccomend this app to customize you account page. :)", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "frontierenaturalmeats", "rating": "5", "posted_at": "March 15, 2022", "body": "The team over at Flits delivers! We needed more than Shopify's basic customer page. We needed an elegant dashboard with tabs for orders, addresses, rewards, and subscriptions. They were amazingly flexible when it came to incorporating information from 3rd party apps. And they even got UPS tracking info to show up on the orders tab. You all are the best!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Ichor Liquid", "rating": "5", "posted_at": "March 10, 2022", "body": "Excellent App. Improves the customer's historical order experience and provides functionality to re-order amongst other features. Due to the complexity of my store, Flits did not work straight out the box and a lot of customisation to correct. This took a few days work, but the developers were there from the start and got everything working exactly how it should.\nThe other Re-Order apps I tried failed to complete a workable solution, however the developers of this app went over and above what was required. Full marks for this great company", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "The Man Company", "rating": "5", "posted_at": "March 10, 2022", "body": "A must have app! Have been using Flits for more than 3 years now, and the experience is great! Kudos to the whole team, for being so helpful & supportive everytime.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Campus&Co Brisbane", "rating": "5", "posted_at": "March 1, 2022", "body": "Have been successfully using this app for several years and can't fault it, and customer service is excellent. Well done, and keep it up!!!", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "714f7dc141869530e7c4939bcecfdc9c", "author": "Quadis | Foodies and Goodies", "rating": "5", "posted_at": "March 1, 2022", "body": "Great app within reasonable budget to manage a store credit/reward program The support team is outstanding - patient, helpful, fast.", "helpful_count": "0", "developer_reply": null, "developer_reply_date": null},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "ROGGENWOLF", "rating": "3", "posted_at": "November 18, 2021", "body": "Ich habe die CleverReach App in Verwendung um mein E-Mail Marketing abzuwickeln. Ich finde es gut, dass CleverReach direkt in Shopify integriert ist, jedoch funktioniert die Einbindung der Formulare nicht in eine Theme (obwohl dies angegeben wird). Ein selbst erstelles Formular von CleverReach kann nur auf einer eigenen Seite angelegt werden und die Anmeldequote dafür ist leider nicht sehr hoch. Sinnvoller ist es das eigene Layout direkt auf der Startseite, im Footer oder als Popup integrieren zu können.", "helpful_count": "0", "developer_reply": "Hallo lieber Plugin User,\nherzlichen Dank für die ausführliche Bewertung.\nEine ausführliche Erklärung, wie Formulare in Shopify eingebunden werden können, finden Sie unter: https://support.cleverreach.de/hc/de/articles/360036028213 . Dort finden Sie ebenfalls eine Anleitung, wie Sie das Formular direkt auf der Homepage einbetten können, zum Beispiel über den Theme Editor.\nBezüglich der PopUp-Funktion: Dies ist über unser Plugin leider erst in näherer Zukunft abbildbar. Aktuell gibt es dafür übergangsweise empfehlenswerte Tool, wie zum Beispiel Uptain.\nBei weiteren Fragen, sind Sie natürlich herzlich dazu eingeladen, unseren Support zu kontaktieren. Schreiben Sie uns dazu gerne eine E-Mail an support@cleverreach.de.\nFreundliche Grüße\nIhr CleverReach Team", "developer_reply_date": "November 23, 2021"},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "Dr Dennis Gross", "rating": "2", "posted_at": "August 2, 2021", "body": "It is too complicated. We didn’t figure out how to segment properly and flows are tricky to set up. The send A LOT of newsletters to you, be prepared!", "helpful_count": "0", "developer_reply": "Hello dear plugin user,\nThank you very much for your open and direct evaluation.\nWe are of course sorry that the segmentation and comprehension of the processes is too complicated for you.\nWe would like to work with you to find a solution to these problems.\nWe offer free support in English, German and Italian via the e-mail address support@cleverreach.com.\nAs soon as any uncertainties or problems occur, you are always welcome to contact us.\nIf you write to us specifically about what is unclear about the segment function, we will be happy to provide you with specific assistance.\nRegarding your perception of receiving too many newsletters:\nYou can unsubscribe from the newsletter at any time via the unsubscribe link.\nIt is only our intention to give as much help and work ideas as possible - because the plugin has so many useful functions.\nWe wish you a good time.\nKind regards\nYour CleverReach Team", "developer_reply_date": "August 19, 2021"},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "snoozi", "rating": "2", "posted_at": "April 27, 2021", "body": "Die Funktionen an sich sind gut, jedoch bin ich über den Kundensupport sehr enttäuscht. Wenn überhaupt eine Antwort kommt, dann erst Tage später", "helpful_count": "0", "developer_reply": "Hallo lieber Plugin User,\nzuerst möchten wir uns bedanken, dass Sie sich die Zeit genommen haben, eine Bewertung zu verfassen.\nAufgrund des aktuell hohen Serviceaufkommens kann es zu Verzögerungen bei der Beantwortung Ihrer Anfrage kommen. Wir arbeiten mit Hochdruck daran, Ihr Anliegen schnellstmöglich zu bearbeiten.\nWir bitten, etwaige Unannehmlichkeiten zu entschuldigen und danken Ihnen bereits vorab für Ihr Verständnis und Ihre Geduld.\nWir wünschen Ihnen eine gesunde Zeit.\nLiebe Grüße\nIhr CleverReach Team", "developer_reply_date": "April 28, 2021"},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "GreenUndies", "rating": "5", "posted_at": "February 12, 2021", "body": "We've been using the free version for 6 weeks, as we just startet with our shop and so far everything works perfectly fine.", "helpful_count": "0", "developer_reply": "Hi GreenUndies,\nthank you for your kind and positive feedback.\nWe are very pleased that working with the plugin meets your expectations.\nIf you still have feature requests or need support, please feel free to contact us at support@cleverreach.com.\nWe wish you a pleasant and healthy time.\nKind regards,\nYour CleverReach team", "developer_reply_date": "February 15, 2021"},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "Savage Roasters", "rating": "2", "posted_at": "December 17, 2020", "body": "I am using the free version. The test emails do not get received, so I send directly to the recipient with the same domain email as the website, but it still doesnt go through. I manage to send to my gmail as a recipient, not a test, but each time I do this, I need to make a copy of that email to send to my actual recipient list, leaving me with alot of the same emails in my list. There is no option to edit after an email has been sent, nor can I delete the test ones I sent to the gmail.", "helpful_count": "0", "developer_reply": "Hi dear Savage Roasters team,\nthank you for your detailed feedback.\nFirst of all, I can completely understand that this causes displeasure to you.\nA blocked mail can have several causes. \nWe offer a variety of technical options to optimize the deliverability of your emails.\nFor example, in conjunction with our tool, setting an SPF record can improve deliverability.\nAlso, you can deposit a subdomain with us and use DKIM (DomainKeys Identified Mail).\nTogether with you, I would like to take a look at your individual possibilities and options in order to make the campaigns possible in an uncomplicated way.\nFor this reason, I have emailed you so that we can take a closer look at your concerns about unsent emails and editing and deleting sent campaigns.\nWe wish you a healthy time, a nice Christmas season and a pleasant end of the year.\nKind regards,\nYour CleverReach team", "developer_reply_date": "December 18, 2020"},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "GS Magazin", "rating": "5", "posted_at": "November 5, 2019", "body": "The app is easy to use. Also suitable for beginners. Has already brought me some results. Actually a must for every shop owner.", "helpful_count": "0", "developer_reply": "Hi GS Magazin,\nthank you so much for your positive feedback! And we totally agree with you: Email marketing is a must for every online shop owner. \nWishing you all the best for your store!\nKind regards,\nCleverReach", "developer_reply_date": "November 5, 2019"},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "Footed Pajamas Co.", "rating": "5", "posted_at": "October 22, 2019", "body": "The app works extremely well.  Prices are in EU since the company is based out of there but the system deliveries and manages email marketing without any issues.", "helpful_count": "1", "developer_reply": "Hey Footed Pajamas Co.,\nwe are very happy about the positive rating and wish you continued success with CleverReach®.\nKind regards,\nCleverReach", "developer_reply_date": "October 23, 2019"},
{"app_id": "d7b143de5bb7f87add611e2d02f63b43", "author": "RZCrew", "rating": "1", "posted_at": "September 17, 2019", "body": "The price plan described in their website and on the app are differents... Thanks for the waste of time.", "helpful_count": "0", "developer_reply": "Hi RZCrew,\nthank you for taking the time to give us a feedback. \nOur plugin itself is free of charge and you can create a free account in CleverReach as well. In the free account you can manage up to 250 recipients and send 1000 mailings a month. \nOn the pricing side of the app you’ll find the notice:\n„External charges may apply. These charges are billed by the external provider and won’t appear on your Shopify invoice. Free of charge test account available.\"\nIf you have further questions, feel free to contact us directly under support@cleverreach.com\nKind regards,\nCleverReach", "developer_reply_date": "September 18, 2019"},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "SafetyGloves by HexArmor", "rating": "4", "posted_at": "April 4, 2022", "body": "We had some initial issues and a possible bug where our application got stuck in a void loop where the application did not exist and I could not reapply. After many communications with Walmart support the issue was eventually resolved. Not through the Shopify app page support email, which leads to an un-monitored email FYI. Eventually, I was able to talk to the right contact and our application got through.", "helpful_count": "0", "developer_reply": "Hi SafetyGloves by HexArmor,\nAs discussed on our email thread, we were able to provide you with the correct access link to the already approved application that was submitted previously. We are happy that we were given the chance to effectively resolve your issue. If further issues occur, please feel free to reach out directly to our support agent.\nThank you,\nWalmart Marketplace Support", "developer_reply_date": "March 31, 2022"},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "Congo Tropicals", "rating": "5", "posted_at": "March 31, 2022", "body": "Edit: My browser Chrome had blocked some cookies that were needed for the app to function properly, after finding the issue and correcting it, i was able to resolve everything. Best fix would be checking allowed cookies and make sure your browser isn't blocking third party cookies which is needed for the app to work.\nIf anyone else is experiencing this issue, check your settings on chrome and allow all cookies. You can check by clicking on the lock symbol next to the address bar to see if your browser is blocking any of them. Hope this helps. the app keeps telling to edit the items in bulk menu, i watched the youtube videos, when looked thru the listings, it only has 2 options, edit category or publish item. The tab to edit products is non existing. items cant be edited from the shopify walmart app. can this get fixed??", "helpful_count": "0", "developer_reply": "Hi Congo Tropicals,\nThank you for your feedback. A Walmart support agent will reach out shortly via email to discuss your issues in more detail.\nThank you,\nWalmart Marketplace Support", "developer_reply_date": "March 31, 2022"},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "yeehawcowboy", "rating": "5", "posted_at": "March 4, 2022", "body": "Great app.. easy to add items... strongly recommend it.. customer service is great as well.. Just wish you didn't have to change each sku to a different # example if your item # is dp5768 but you have multiple variants you have to make make it dp5768-1 dp5768-2", "helpful_count": "2", "developer_reply": null, "developer_reply_date": null},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "Equine Goddess(R)", "rating": "4", "posted_at": "January 18, 2022", "body": "Getting better - must say it was rocky starting out with this app. The shipping criteria, even with videos, is rather difficult. Now that I've struggled through for about a month, I finally understand it, and things are much smoother. Next step is bulk loading, so I'll report back after that.", "helpful_count": "3", "developer_reply": null, "developer_reply_date": null},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "PayandPack.com", "rating": "1", "posted_at": "December 27, 2021", "body": "The inventories are never synced on time from Shopify to Walmart, unless you manually change the quantity for SKU one by one, so the Walmart listings' inventory can be updated respectively. The only feature is FREE, you know, you pay what you got, free means.....", "helpful_count": "1", "developer_reply": "Hi PayandPack.com,\nThank you for your feedback. A Walmart support agent will reach out shortly to discuss your issues in more detail.\nThank you,\nWalmart Marketplace Support", "developer_reply_date": "January 10, 2022"},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "rbeey", "rating": "1", "posted_at": "November 16, 2021", "body": "HORRIBLE APP...App never synced tracking information back to Walmart and I had to manually update tracking information for all orders otherwise Walmart would have cancelled my orders and pay me nothing....was it even tested before rolling out....If there was a bug at least add exemption in seller account to prevent revenue loss to customers. Going to delete this as soon as my orders are delivered. If you expect quality from sellers to ship on time and process everything on time at least give back the quality to sellers.", "helpful_count": "0", "developer_reply": "Hi rbeey,\nThank you for your feedback. A Walmart support agent will reach out shortly to discuss your issues in more detail.\nThank you,\nWalmart Marketplace Support", "developer_reply_date": "November 17, 2021"},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "NYCK - New York City Kicks", "rating": "1", "posted_at": "November 16, 2021", "body": "STAY AWAY FROM THIS APP , HORRIBLE HOIRRIBLE HORRIBLE I HAD TO FREEZE MY WALMART ACCOUNT , IT INCREASED MY INVENTORY BY CRAZY AMOUNT , THE SUPPORT DO NOT KNOW NOTHING ABOUT THE INTEGRATION , THEY TOLD ME I SHOULD CONTACT SHOPIFY , WHILE THE APP WAS DEVELOPED BY WALMART HORRIBLE APP, HORRIBLE COMPANY , WHAT A NIGHMARE", "helpful_count": "0", "developer_reply": "Hi NYCK - New York City Kicks,\nThank you for your feedback. A Walmart support agent will reach out shortly to discuss your issues in more detail.\nThank you,\nWalmart Marketplace Support", "developer_reply_date": "November 17, 2021"},
{"app_id": "d0d5432f20fd073f74a58033b5c325fe", "author": "LaughingMooseGifts", "rating": "1", "posted_at": "November 6, 2021", "body": "Earlier this year I installed this app when we began selling on the Walmart Marketplace. The first order we shipped was never paid for by Walmart because the shipping information didn't post back to the Walmart Admin Portal; Walmart canceled the order because 'it was way late' even though the customer had long since taken delivery. We have had multiple late orders in the Walmart Admin panel in the past few months either because they never were pushed through to Shopify and consequently to our order management system. Or because orders were shipped, but never updated as shipped back to the Walmart Admin Portal. What a disaster. Honestly I don't understand why this app exists on the Shopify App Store.", "helpful_count": "1", "developer_reply": "Hi LaughingMooseGifts,\nThank you for your feedback. We are looking into this and will provide an update shortly. Please be on the lookout for an email from one of our support agents regarding this matter.\nThank you,\nWalmart Marketplace Support", "developer_reply_date": "November 9, 2021"},
